In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('../../Data/titanic.csv')

In [3]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

# We whant to know the average passenger with pclass and gender.
## We can use pass 2 DataFrames in the crosstab function

In [4]:
pd.crosstab(titanic.sex, titanic.pclass)

pclass    1    2    3
sex
female   94   76  144
male    122  108  347

 - normalize=True will return the percentage of the total

In [7]:
pd.crosstab(index=titanic.sex, columns=titanic.pclass, values=titanic.age, aggfunc='mean', margins=True, margins_name='Mean',
            normalize=True)

pclass         1         2         3      Mean
sex
female  0.188502  0.156431  0.118455  0.476033
male    0.224826  0.167420  0.144366  0.523967
Mean    0.410003  0.320398  0.269600  1.000000

In [8]:
summer = pd.read_csv('../summer.csv')

In [9]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

CROSSTAB()

In [10]:
pd.crosstab(
    index=[summer.Year, summer.Country], columns=summer.Medal, values=summer.Athlete, aggfunc='count', margins=True, margins_name='Total'
).fillna(0)

Medal           Bronze     Gold   Silver  Total
Year  Country
1896  AUS          0.0      2.0      0.0      2
      AUT          2.0      2.0      1.0      5
      DEN          3.0      1.0      2.0      6
      FRA          2.0      5.0      4.0     11
      GBR          2.0      2.0      3.0      7
...                ...      ...      ...    ...
2012  UKR         12.0      9.0      4.0     25
      USA         46.0    147.0     57.0    250
      UZB          2.0      1.0      0.0      3
      VEN          0.0      1.0      0.0      1
Total          10369.0  10484.0  10308.0  31161

[1158 rows x 4 columns]

PIVOT_TABLE()

In [11]:
summer.pivot_table(index='Country', columns='Medal', values='Athlete', aggfunc='count', fill_value=0, margins=True, margins_name='Total')

Medal    Bronze   Gold  Silver  Total
Country
AFG           2      0       0      2
AHO           0      0       1      1
ALG           8      5       2     15
ANZ           5     20       4     29
ARG          91     69      99    259
...         ...    ...     ...    ...
YUG         118    143     174    435
ZAM           1      0       1      2
ZIM           1     18       4     23
ZZX          10     23      15     48
Total     10369  10484   10308  31161

[148 rows x 4 columns]

GROUPBY()

In [12]:
summer.groupby(['Country', 'Medal']).Athlete.count().unstack(fill_value=0)

Medal    Bronze  Gold  Silver
Country
AFG           2     0       0
AHO           0     0       1
ALG           8     5       2
ANZ           5    20       4
ARG          91    69      99
...         ...   ...     ...
VIE           0     0       2
YUG         118   143     174
ZAM           1     0       1
ZIM           1    18       4
ZZX          10    23      15

[147 rows x 3 columns]